board = [
    [0, 1, 2, 3, 4, 5],
    [2, 2, 3, 4, 5, 6],
    [4, 3, 4, 5, 6, 7],
    [6, 4, 5, 6, 7, 8],
    [8, 5, 6, 7, 8, 9],
    [10, 21, 22, 23, 24, 25],
    [12, 7, 8, 9, 10, 11],
    [14, 8, 9, 10, 11, 12],
    [16, 9, 10, 11, 12, 13],
    [18, 10, 11, 12, 13, 14],
    [20, 27, 28, 24, 25, 26],
    [22, 12, 13, 14, 15, 16],
    [24, 13, 14, 15, 16, 17],
    [26, 14, 15, 16, 17, 18],
    [28, 15, 16, 17, 18, 19],
    [30, 29, 30, 31, 24, 25],
    [32, 17, 18, 19, 20, 32],
    [34, 18, 19, 20, 32, 32],
    [36, 19, 20, 32, 32, 32],
    [38, 20, 32, 32, 32, 32],
    [40, 32, 32, 32, 32, 32],
    [13, 22, 23, 24, 25, 26],
    [16, 23, 24, 25, 26, 20],
    [19, 24, 25, 26, 20, 32],
    [25, 25, 26, 20, 32, 32],
    [30, 26, 20, 32, 32, 32],
    [35, 20, 32, 32, 32, 32],
    [22, 28, 24, 25, 26, 20],
    [24, 24, 25, 26, 20, 32],
    [28, 30, 31, 24, 25, 26],
    [27, 31, 24, 25, 26, 20],
    [26, 24, 25, 26, 20, 32],
    [0, 32, 32, 32, 32, 32]
]

moves = list(map(int, input().split()))
result = 0


def get_score(state):
    ret = 0
    # 해당 칸에 말이 있으면 움직일 수 없다
    visited = [0]*33
    # 말의 위치
    pos = [0]*4
    for turn in range(10):
        move = moves[turn]
        # turn만큼 shift 후 뒤의 두글자와 and 연산해서 몇번째 말 정하기
        horse = (state >> (turn*2)) & 0x03
        # 말의 현재 위치
        horse_pos = pos[horse]
        # 말의 다음 위치와 얻게될 점수
        next_pos = board[horse_pos][move]
        add_score = board[next_pos][0]
        if visited[next_pos] and next_pos != 32:
            return -1

        ret += add_score
        visited[horse_pos] = 0
        visited[next_pos] = 1
        pos[horse] = next_pos
    return ret


for state in range(1 << 20):
    candi = get_score(state)
    if result < candi:
        result = candi

print(result)